In [62]:
import pandas as pd

In [63]:
df=pd.read_csv('/Users/dylanbai/Desktop/Data Science/Assignments/sales_data.csv')

In [64]:
df

         Product    Region   Price  Units Sold   Sale Date
0            NaN  Region_6   75.96        10.0  2022-01-01
1            NaN  Region_1  175.78         8.0  2022-01-02
2     Product_46  Region_3   20.43        12.0  2022-01-03
3     Product_36  Region_1   12.77        10.0  2022-01-04
4     Product_17  Region_6  125.69         6.0  2022-01-05
...          ...       ...     ...         ...         ...
1045  Product_45  Region_7   78.69         8.0  2022-07-28
1046   Product_1  Region_6     NaN         8.0  2022-08-02
1047  Product_17  Region_2  114.37        11.0  2023-12-18
1048         NaN  Region_8     NaN         5.0  2023-12-27
1049  Product_16  Region_2   69.30         8.0  2024-02-23

[1050 rows x 5 columns]

In [65]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1050 entries, 0 to 1049
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Product     947 non-null    object
 1   Region      946 non-null    object
 2   Price       945 non-null    float64
 3   Units Sold  946 non-null    float64
 4   Sale Date   1050 non-null   object
dtypes: float64(2), object(3)
memory usage: 41.1+ KB

In [66]:
df=df.dropna()

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 687 entries, 2 to 1049
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Product     687 non-null    object
 1   Region      687 non-null    object
 2   Price       687 non-null    float64
 3   Units Sold  687 non-null    float64
 4   Sale Date   687 non-null    object
dtypes: float64(2), object(3)
memory usage: 32.2+ KB

In [68]:
df.drop_duplicates(inplace=True)

/var/folders/xg/p7xsrph1757b22c90718xp3m0000gn/T/ipykernel_78171/3006716147.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.drop_duplicates(inplace=True)

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 651 entries, 2 to 999
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Product     651 non-null    object
 1   Region      651 non-null    object
 2   Price       651 non-null    float64
 3   Units Sold  651 non-null    float64
 4   Sale Date   651 non-null    object
dtypes: float64(2), object(3)
memory usage: 30.5+ KB

In [70]:
df.describe()

             Price  Units Sold
count   651.000000  651.000000
mean    107.254777   10.058372
std     131.283393    3.180658
min       0.200000    2.000000
25%      29.330000    8.000000
50%      76.010000   10.000000
75%     139.555000   12.000000
max    2143.300000   22.000000

In [71]:
df=df[(df['Price']>0)]

In [72]:
df.index

Index([  2,   3,   4,   5,   6,   7,   8,   9,  11,  13,
       ...
       977, 978, 980, 981, 982, 985, 993, 994, 998, 999],
      dtype='int64', length=651)

In [73]:
df.columns

Index(['Product', 'Region', 'Price', 'Units Sold', 'Sale Date'], dtype='object')

In [74]:
df.axes

[Index([  2,   3,   4,   5,   6,   7,   8,   9,  11,  13,
        ...
        977, 978, 980, 981, 982, 985, 993, 994, 998, 999],
       dtype='int64', length=651),
 Index(['Product', 'Region', 'Price', 'Units Sold', 'Sale Date'], dtype='object')]

In [75]:
df.dtypes

Product        object
Region         object
Price         float64
Units Sold    float64
Sale Date      object
dtype: object

In [76]:
df

        Product     Region   Price  Units Sold   Sale Date
2    Product_46   Region_3   20.43        12.0  2022-01-03
3    Product_36   Region_1   12.77        10.0  2022-01-04
4    Product_17   Region_6  125.69         6.0  2022-01-05
5    Product_45   Region_1    8.63        11.0  2022-01-06
6    Product_31   Region_3   23.73         6.0  2022-01-07
..          ...        ...     ...         ...         ...
985  Product_40   Region_7  144.37         5.0  2024-09-12
993   Product_7   Region_9  128.51        17.0  2024-09-20
994   Product_1   Region_4   95.24         7.0  2024-09-21
998   Product_2  Region_10   43.44        15.0  2024-09-25
999  Product_35   Region_8   56.95         6.0  2024-09-26

[651 rows x 5 columns]

In [100]:
df_grouped_region=df.groupby('Region').aggregate(total_sales=('Units Sold','sum'),average_price=('Price','mean'))

In [101]:
df_grouped_region

           total_sales  average_price
Region
Region_1         601.0     100.819661
Region_10        745.0     102.338667
Region_2         630.0     126.656557
Region_3         599.0      98.618333
Region_4         736.0     102.634400
Region_5         656.0     103.206818
Region_6         596.0      84.027586
Region_7         467.0      91.926170
Region_8         655.0     150.250152
Region_9         863.0     106.381905

In [102]:
df_grouped_region.sort_values('total_sales', ascending=True)

           total_sales  average_price
Region
Region_7         467.0      91.926170
Region_6         596.0      84.027586
Region_3         599.0      98.618333
Region_1         601.0     100.819661
Region_2         630.0     126.656557
Region_8         655.0     150.250152
Region_5         656.0     103.206818
Region_4         736.0     102.634400
Region_10        745.0     102.338667
Region_9         863.0     106.381905

In [104]:
df_grouped_product=df.groupby('Product').aggregate(total_sales=('Units Sold','sum'))

In [105]:
df_grouped_product

            total_sales
Product
Product_1         160.0
Product_10        119.0
Product_11         80.0
Product_12         61.0
Product_13        206.0
Product_14        137.0
Product_15        124.0
Product_16        171.0
Product_17        155.0
Product_18        105.0
Product_19        171.0
Product_2         151.0
Product_20         78.0
Product_21        123.0
Product_22         78.0
Product_23        141.0
Product_24        122.0
Product_25        150.0
Product_26        113.0
Product_27        125.0
Product_28        106.0
Product_29        144.0
Product_3          83.0
Product_30        148.0
Product_31        209.0
Product_32         85.0
Product_33        165.0
Product_34        132.0
Product_35        127.0
Product_36         79.0
Product_37        146.0
Product_38         83.0
Product_39        108.0
Product_4         186.0
Product_40        133.0
Product_41        142.0
Product_42         99.0
Product_43        181.0
Product_44         91.0
Product_45        107.0
Product_46        143.0
Product_47        105.0
Product_48        198.0
Product_49        114.0
Product_5         190.0
Product_50        203.0
Product_6         115.0
Product_7         110.0
Product_8         121.0
Product_9         125.0

In [106]:
df_grouped_product.sort_values('total_sales', ascending=True)

            total_sales
Product
Product_12         61.0
Product_22         78.0
Product_20         78.0
Product_36         79.0
Product_11         80.0
Product_38         83.0
Product_3          83.0
Product_32         85.0
Product_44         91.0
Product_42         99.0
Product_18        105.0
Product_47        105.0
Product_28        106.0
Product_45        107.0
Product_39        108.0
Product_7         110.0
Product_26        113.0
Product_49        114.0
Product_6         115.0
Product_10        119.0
Product_8         121.0
Product_24        122.0
Product_21        123.0
Product_15        124.0
Product_9         125.0
Product_27        125.0
Product_35        127.0
Product_34        132.0
Product_40        133.0
Product_14        137.0
Product_23        141.0
Product_41        142.0
Product_46        143.0
Product_29        144.0
Product_37        146.0
Product_30        148.0
Product_25        150.0
Product_2         151.0
Product_17        155.0
Product_1         160.0
Product_33        165.0
Product_19        171.0
Product_16        171.0
Product_43        181.0
Product_4         186.0
Product_5         190.0
Product_48        198.0
Product_50        203.0
Product_13        206.0
Product_31        209.0